#+title: Cálculo Diferencial en una variable
#+startup: overview latexpreview

* Tools

#+begin_src cpp :results output :flags -std=gnu++20
#include <iostream>
#include <string>
#include <format>

int main() {
    
    double r=0;

    for (int i=1; i<=1000; i++) {
        r += 1.0/(i*i);
    }

    std::cout << "Result: " << std::format("{}", r) << std::endl;
}
#+end_src

#+RESULTS:
: Starting
: Result: 1.6439345666815615
